const handler = async (m, {conn, usedPrefix, command}) => {
  const res = await dknrididjaajj[Math.floor(Math.random() * dknrididjaajj.length)];
  conn.sendMessage(m.chat, {video: {url: res}, caption: ` ✯≼══━━﹂⛩️﹁━━══≽✯
*اوامــر الـمطــور*
✯≼══━━﹂⛩️﹁━━══≽✯
*◞❐║🏮║⇠『بريم』◈◜*
*◞❐║🏮║⇠『ضيف_جواهر』◈◜*
*◞❐║🏮║⇠『اعدادات』◈◜*
*◞❐║🏮║⇠『الغاء-الحظر』◈◜*
*◞❐║🏮║⇠『حظر』◈◜*
*◞❐║🏮║⇠『بان』◈◜*
*◞❐║🏮║⇠『الغاء』◈◜*
*◞❐║🏮║⇠『الغاء-بان』◈◜*
*◞❐║🏮║⇠『المبندين』◈◜*
*◞❐║🏮║⇠『المحظورين』◈◜*
*◞❐║🏮║⇠『تشغيل』◈◜*
*◞❐║🏮║⇠『تعطيل』◈◜*
*◞❐║🏮║⇠『حذف_بريميا』◈◜*
✯≼══━━﹂⛩️﹁━━══≽✯
*❐║حقوق║🏮𝑊𝐴𝑁𝛩🏮 》*
✯≼══━━﹂⛩️﹁━━══≽✯   `}, {quoted: m});
};
handler.help = ['dknrididjaajj'];
handler.tags = ['random'];
handler.command = /^7$/;
export default handler;

global.dknrididjaajj = [
  'https://telegra.ph/file/4a3684852fd3f7d1a96a6.mp4 ',
  
];
