const handler = async (m, {conn, usedPrefix, command}) => {
  const res = await jdjfhsvrury[Math.floor(Math.random() * jdjfhsvrury.length)];
  conn.sendMessage(m.chat, {video: {url: res}, caption: ` ✯≼══━━﹂⛩️﹁━━══≽✯
*اوامـر الـمـشـرفيـن*
✯≼══━━﹂⛩️﹁━━══≽✯
*◞❐║🏮║⇠『جروب』◈◜*
*◞❐║🏮║⇠『اعفاء』◈◜*
*◞❐║🏮║⇠『جروب فتح』◈◜*
*◞❐║🏮║⇠『جروب قفل』◈◜*
*◞❐║🏮║⇠『ترقيه』◈◜*
*◞❐║🏮║⇠『تغير-الاسم』◈◜*
*◞❐║🏮║⇠『تغيرالصوره』◈◜*
*◞❐║🏮║⇠『تغيرالورصق』◈◜*
*◞❐║🏮║⇠『حذف』◈◜*
*◞❐║🏮║⇠『دعوه』◈◜*
*◞❐║🏮║⇠『تغييرالليك』◈◜*
*◞❐║🏮║⇠『طرد*
*◞❐║🏮║⇠『منشن』◈◜*
*◞❐║🏮║⇠『لمنشن』◈◜*
*◞❐║🏮║⇠『مخفي』◈◜*
✯≼══━━﹂⛩️﹁━━══≽✯
*❐║حقوق║🏮𝑊𝐴𝑁𝛩🏮 》*
✯≼══━━﹂⛩️﹁━━══≽✯    `}, {quoted: m});
};
handler.help = ['jdjfhsvrury'];
handler.tags = ['random'];
handler.command = /^5$/;
export default handler;

global.jdjfhsvrury = [
  'https://telegra.ph/file/57f31420ff9f8ffb64d29.mp4 ',
  
];
