

let handler = async (m, { command, text }) => m.reply(`

⛩️┃Wαɳσ『 🏮』change┃⛩️

*مرحبا بك في نقابة وانو*

✯≼══━━﹂🏮﹁━━══≽✯
*❆🎭┊الــلــقـب* 
*〘〙*

*❆📖┊مــن اي أنمي* 
*〘〙*

*❆⁉️┊بـنـت او ولـد* 
*〘〙*

*❆🪢┊مـن طـرف* 
*〘〙اكتب اسم الشخص او الحساب الي جبت منه الرابط*
✯≼══━━﹂🏮﹁━━══≽✯

*❈↲لملئ الإستمارة يرجى النسخ وملء الفراغات*
*❈↲بعد ملئ الاستمارة منشن احد المشرفين*
*❈↲يرجى ارفاق صورة للشخصية التي اخترتها*

✯≼══━━﹂🏮﹁━━══≽✯
*مع تحيات ادارة *
*『Wαɳσ⊰🏮⊱change』*
*❈↲لملئ الإستمارة يرجى النسخ وملء الفراغات*
*❈↲بعد ملئ الاستمارة منشن احد المشرفين*
*❈↲يرجى ارفاق صورة للقب*
 `.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['استماره <teks>?']
handler.tags = ['استماره', 'fun']
handler.command = /^(استماره)$/i

export default handler
