const handler = async (m, {conn, usedPrefix, command}) => {
  const res = await kddkkdjdj[Math.floor(Math.random() * kddkkdjdj.length)];
  conn.sendMessage(m.chat, {video: {url: res}, caption: ` ✯≼══━━﹂⛩️﹁━━══≽✯
*اهـلـا بـك فـي قـسـم اوامـر الاعـ👤ـضـا*
✯≼══━━﹂⛩️﹁━━══≽✯
*◞❐║🏮║⇠『ايديت』◈◜*
*◞❐║🏮║⇠『استطلاع』◈◜*
*◞❐║🏮║⇠『اكسبي』◈◜*
*◞❐║🏮║⇠『التعدين』◈◜*
*◞❐║🏮║⇠『الطقس』◈◜*
*◞❐║🏮║⇠『نقودي』◈◜*
*◞❐║🏮║⇠『المشرفين』◈◜*
*◞❐║🏮║⇠『ايديت2』◈◜*
*◞❐║🏮║⇠『انمي』◈◜*
*◞❐║🏮║⇠『مانجا』◈◜*
*◞❐║🏮║⇠『كود』◈◜*
*◞❐║🏮║⇠『بروفايل』◈◜*
*◞❐║🏮║⇠『فلتر』◈◜*
*◞❐║🏮║⇠『بلاك-بيك』◈◜*
*◞❐║🏮║⇠『بنك』◈◜*
*◞❐║🏮║⇠『تحداني』◈◜*
*◞❐║🏮║⇠『راتب』◈◜*
*◞❐║🏮║⇠『رياضيات』◈◜*
*◞❐║🏮║⇠『شغل』◈◜*
*◞❐║🏮║⇠『شراء』◈◜*
*◞❐║🏮║⇠『تطقيم』◈◜*
*◞❐║🏮║⇠『تطقيم-اولاد』◈◜*
*◞❐║🏮║⇠『تطقيم4』◈◜*
*◞❐║🏮║⇠『لولي』◈◜*
*◞❐║🏮║⇠『لولي-فيد』◈◜*
*◞❐║🏮║⇠『ميمز』◈◜*
*◞❐║🏮║⇠『تحدي』◈◜*
*◞❐║🏮║⇠『تصميم』◈◜*
✯≼══━━﹂⛩️﹁━━══≽✯
*❐║حقوق║🏮𝑊𝐴𝑁𝛩🏮 》*
✯≼══━━﹂⛩️﹁━━══≽✯    `}, {quoted: m});
};
handler.help = ['kddkkdjdj'];
handler.tags = ['random'];
handler.command = /^2$/;
export default handler;

global.kddkkdjdj = [
  'https://telegra.ph/file/ecebc1700f7818997333f.mp4 ',
  
];
