const handler = async (m, {conn, usedPrefix, command}) => {
  const res = await nnaodbfc[Math.floor(Math.random() * nnaodbfc.length)];
  conn.sendMessage(m.chat, {video: {url: res}, caption: ` ✯≼══━━﹂⛩️﹁━━══≽✯
*اهـلـا بـك فـي قـسـم الـتــ🎮ــرفـيـه*
✯≼══━━﹂⛩️﹁━━══≽✯
*◞❐║🏮║⇠『سؤال』◈◜*
*◞❐║🏮║⇠『احزر』◈◜*
*◞❐║🏮║⇠『احزر2』◈◜*
*◞❐║🏮║⇠『اكس』◈◜*
*◞❐║🏮║⇠『الشخصيه』◈◜*
*◞❐║🏮║⇠『غباء』◈◜*
*◞❐║🏮║⇠『توب』◈◜*
*◞❐║🏮║⇠『جيف』◈◜*
*◞❐║🏮║⇠『حكم』◈◜*
*◞❐║🏮║⇠『دمج』◈◜*
*◞❐║🏮║⇠『ذكاء』◈◜*
*◞❐║🏮║⇠『غباء』◈◜*
*◞❐║🏮║⇠『صفع』◈◜*
*◞❐║🏮║⇠『طبطبه』◈◜*
*◞❐║🏮║⇠『علم』◈◜*
*◞❐║🏮║⇠『صراحه』◈◜*
*◞❐║🏮║⇠『شبهي』◈◜*
*◞❐║🏮║⇠『فعاليه』◈◜*
*◞❐║🏮║⇠『عين』◈◜*
*◞❐║🏮║⇠『قطه』◈◜*
*◞❐║🏮║⇠『كلب』◈◜*
*◞❐║🏮║⇠『لو』◈◜*
*◞❐║🏮║⇠『هجوم』◈◜*
*◞❐║🏮║⇠『نرد』◈◜*
*◞❐║🏮║⇠『ورع』◈◜*
*◞❐║🏮║⇠『خروف』◈◜*
*◞❐║🏮║⇠『جميل』◈◜*
*◞❐║🏮║⇠『وانو』◈◜*
*◞❐║🏮║⇠『كت』◈◜*
*◞❐║🏮║⇠『تاج』◈◜*
✯≼══━━﹂⛩️﹁━━══≽✯
*❐║حقوق║ 🏮𝑊𝐴𝑁𝛩🏮┃ 》
✯≼══━━﹂⛩️﹁━━══≽✯    `}, {quoted: m});
};
handler.help = ['nnaodbfc'];
handler.tags = ['random'];
handler.command = /^م1$/;
export default handler;

global.nnaodbfc = [
  'https://telegra.ph/file/86f2832d397c7c5e348b0.mp4 ',
  
];
