let handler = async (m, { conn }) => {
conn.reply(m.chat,`**\n\n*“${pickRandom(global.verdaad)}”*\n\n**`, m)
let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^تاج$/i.test(m.text)) { 
     responses = [ 

,   'اول منشن ذكي'
,  'اول منشن عمك'
'اول منشن يحبك
,  'ثاني منشن حمار'
,  ' ثالث منشن يحب رايلي اكثر منك'
,  'خامس منشن اوتاكو ورع"
,  'ثالث منشن خايس'
,  'ثاني منشن انت عمه' 
,  'ثالث منشن محنك", 
,  'ثالث منشن يشوف اتاك عمك", 
,  'ثاني منشن يشوف ون بيس عمك", 
,  ' ثالث منشن يحبك", 
,  ' رابع منشن غدار", 
,  ' خامس منشن ورع", 
,  ' خامس منشن ", 
,  'ثاني منشن بيترقي قبلك", 
,  ' ثاني منشن نوب", 
,  ' اول منشن بيكراش عليك", 
' اول منشن زهقان منك", 
,  ' ثالث منشن نرد", 
,  ' سادس منشن سحبه", 
,  'اول منشن هيهرب منكم", 
,  'ثالث منشن حمار", 
,  'ثالث منشن يثق فيك", 
  , let handler = async (m, { conn }) => {
conn.reply(m.chat,`**\n\n*“${pickRandom(global.verdaad)}”*\n\n**`, m)
let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^تاج$/i.test(m.text)) { 
     responses = [ 

,  ` اول منشن ذكي`
,  `اول منشن عمك`
,  `اول منشن يحبك`
,  `ثاني منشن حمار`
,  ` ثالث منشن يحب رايلي اكثر منك`
,  `خامس منشن اوتاكو ورع`
,  `ثالث منشن خايس `
,  `ثاني منشن انت عمه` 
,  `ثالث منشن محنك`
,  `ثالث منشن يشوف اتاك عمك`
,  `ثاني منشن يشوف ون بيس عمك`
,  ` ثالث منشن يحبك`
,  `رابع منشن غدار`
,  ` خامس منشن ورع`
,  ` خامس منشن`  
,  `ثاني منشن بيترقي قبلك`
,  ` ثاني منشن نوب` 
,   `اول منشن بيكراش عليك` 
,  ` اول منشن زهقان منك`

 ,   'اول منشن فاطر'
,  ` سادس منشن سحبه`

,   `اول منشن هيهرب منكم `
,  `ثالث منشن حمار` 
,  `ثالث منشن يثق فيك` 
,  `ثاني منشن زهق منك` 
,  `رابع منشن فإن ناروتو `
,  `خامس منشن غبي` 
,  `رابع منشن خروف`
,  `ثاني منشن بيكرهك` 
,  `اول منشن يحبك` 
,  `ثالث منشن عوطاكو`  
,  `هش بقا صدعتني` 
,  `ثالث منشن ذكي` 
,  `ثاني منشن فخم`
,  `اول منشن فخم` 
,  `خامس منشن اذكي منك`
,  `رابع منشن اغبي منك`
,  `اول منشن بيفداك😉` 
,  `اول منشن يكره`
 `   ثاني  منشن بيموت  ` 
,  `تاسع منشن يشوفك بطل` 
,  `رابع منشن يشوفك ورع`
 ];
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler
  `رابع منشن فإن ناروتو`
,  'خامس منشن غبي", 
'رابع منشن خروف" , 
'ثاني منشن بيكرهك" , 
'اول منشن يحبك" , 
'ثالث منشن عوطاكو" , 
'هش بقا صدعتني" , 
'ثالث منشن ذكي" , 
'ثاني منشن فخم" , 
'اول منشن فخم" , 
'خامس منشن اذكي منك" , 
'رابع منشن اغبي منك" , 
'اول منشن بيفداك😉" , 
'اول منشن يكرهك" , 
'ثالث منشن يراقبك' 
'تاسع منشن يشوفك بطل' , 
' رابع منشن يشوفك ورع'
 ];
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;
